# указываем базовый образ. В данном случае используем легковесный образ Python 3.11
FROM python:3.11

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Сначала копируем только файл с зависимостями
COPY requirements.txt .
RUN pip install --upgrade pip \
    && pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы приложения(Но так как нам не нужно файлы по типу данных, readme и тд, мы доктируем их в .dockerignore)
COPY . /app

# Открываем порт 8000 для доступа к приложению
EXPOSE 8000 

# Указываем команду для запуска приложения при старте контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]
